Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: འདི་ནི་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་ལྔ་པ་ཡིན་ནོ།
en: This is the fifth perception of dislike, which is related to the gods of the desire realm.

source: །འདི་ནི་རྣམ་པ་ལྔ་པ་ཡིན་ཏེ། མཁས་པས་འདོད་པའི་ཁམས་འདི་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: Those were the five ways in which the wise ones should generate the perception of dislike toward the entire desire realm.

source: །ཀཽ་ཌི་ནྱ་དེ་ལ་མཁས་པས་ཇི་ལྟར་གཟུགས་ན་སྤྱོད་པའི་ལྷ་རྣམས་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་ཞེ་ན།
en: “Kauṇḍinya, how should the wise ones generate the perception of dislike toward the gods of the form realm?

source: སེམས་ཅན་གང་དག་གཟུགས་ན་སྤྱོད་པ་བཅུ་དྲུག་ཡོད་པ་དེ་དག་ཀྱང་ལྷའི་རིས་རྣམས་ཀྱི་ནང་ན་འཇིག་རྟེན་པའི་བསམ་གཏན་དག་སྒོམ་པར་བྱེད་དེ། དེ་དག་ཐམས་ཅད་ཟག་པ་དང་བཅས་པའི་སྡུག་བསྔལ་རྣམས་ཀྱིས་ཡོངས་སུ་མ་གྲོལ་བ་ཡིན།
en: Among the classes of gods, the sixteen types of gods of the form realm cultivate the worldly concentrations, so none of them are free from the sufferings associated with defilement.

source: སྡུག་བསྔལ་མང་པོས་གཟིར་བ་ཡིན། ལྷག་མ་དང་བཅས་པའི་འགྲོ་བ་ཉིད་ཀྱི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་ཡིན།
en: They are still tormented by many types of suffering, including the suffering of being born with remainder.

source: ཕ་རོལ་ལ་མི་ལྟ་བ་རྣམས་ཡིན། ངེས་པར་འབྱུང་བར་མི་ལྟ་བ་རྣམས་ཡིན། ངན་སོང་གི་སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་མ་གྲོལ་བ་ཡིན་ཏེ།
en: They do not care about transcendence and escape, and so they are not free from the sufferings of the lower realms.

source: སྡུག་བསྔལ་དེ་དག་གིས་གཟིར་བ་ཡིན་ན་མཁས་པ་སུ་ཞིག་དེ་དག་ལ་དགའ་བར་སེམས་ཤིང་འདོད་པ་སྐྱེད་པར་བྱེད།
en: Since they are tormented by such sufferings, what wise one would enjoy and wish for their condition?

source: མཁས་པས་དེ་ལྟར་གཟུགས་ཀྱི་ཁམས་དེ་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: The wise ones should generate the perception of dislike toward the form realm in this way.

source: །གཞན་ཡང་གཟུགས་ཀྱི་ཁམས་དེ་ན་སེམས་ཅན་གང་དག་ཟག་པ་མེད་པའི་བསམ་གཏན་དང་ཡང་དག་པར་ལྡན་ཞིང་ཡོངས་སུ་གྲོལ་བ་མ་ཡིན་པར་གནས་པ་འཕགས་པའི་ལམ་གྱི་ཚེ་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་ཡིན་ཞིང་།
en: “Furthermore, those sentient beings within the form realm, who have not attained undefiled concentration and who are not free, are tormented by suffering as they follow the path of the noble ones.

source: དེ་ཡོངས་སུ་རྫོགས་པ་ཀུན་ཏུ་ཚོལ་བའི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་ཡིན། ས་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་དབང་མི་བྱེད་པའི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན་ཏེ།
en: They are tormented by the suffering caused by their pursuit of perfection, and they are tormented by the fact that they do not master the absorptions related to all the levels.

source: དེ་དག་རང་རྒྱལ་བ་དང་ཐུན་མོང་བའི་ཏིང་ངེ་འཛིན་ལ་དབང་སྒྱུར་བ་མེད་པ་ཉིད་ཀྱི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་ཡིན་ནོ། །དེ་དག་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་དབང་སྒྱུར་བ་མེད་པ་ཉིད་ཀྱི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་ཡིན་ནོ།
en: They are tormented by the suffering caused by their lack of mastery of the absorptions common to the solitary buddhas, and they are tormented by their lack of mastery of the domain of the thus-gone ones.

source: །དེ་ན་གང་དག་མགོ་མཉམ་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་སྡུག་བསྔལ་དེ་རྣམས་ཀྱིས་གཟིར་བ་ཡིན་ནོ།
en: Those gods, who will eventually pass away in those places, are tormented by such sufferings.

source: །མཁས་པས་དེ་ལྟར་གཟུགས་ཀྱི་ཁམས་དེ་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: The wise ones should therefore generate the perception of dislike toward the form realm.

source: །ཀཽ་ཌི་ནྱ་དེ་ལ་མཁས་པས་ཇི་ལྟར་གཟུགས་མེད་པའི་ཁམས་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་ཞེ་ན།
en: “Kauṇḍinya, how should the wise ones generate the perception of dislike toward the formless realm?

source: གཟུགས་མེད་པའི་རིས་ཀྱི་ལྷའི་གནས་བཞི་པོ་དེ་དག་ན་ཡང་སེམས་ཅན་རྣམས་ཟག་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་རྣམས་དང་ལྡན་པ་ཡིན་ཏེ། དེ་དག་ཐམས་ཅད་ཟག་པ་དང་བཅས་པའི་སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་མ་གྲོལ་བ་དག་ཡིན། སྡུག་བསྔལ་དེ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན།
en: Within the four divine abodes of the formless realm, sentient beings are also absorbed in defiled concentrations—none of them are free from the sufferings associated with defilement.

source: དེ་དག་སློབ་པ་དང་མི་སློབ་པའི་ས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་མེད་པ་དག་ཡིན། སྡུག་བསྔལ་དེ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན།
en: They are tormented by such sufferings and by the suffering caused by the fact that they do not master the levels of training and no more training.

source: ཆོས་མི་ཐོས་པའི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན། སྲེད་པ་ཐམས་ཅད་གཏན་དུ་བཅད་པ་ལ་དབང་སྒྱུར་བ་མེད་པ་ཉིད་ཀྱི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན།
en: They are tormented by the sufferings of not hearing the Dharma and lacking mastery of the permanent elimination of all forms of craving.

source: དེ་ནས་འཆི་འཕོ་བའི་ཆོས་ཀྱི་རྣམ་པ་དང་། ལྷག་མ་དང་བཅས་པར་འགྲོ་བ་ཉིད་ཀྱི་སྡུག་བསྔལ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན།
en: They are also tormented by the sufferings related to the circumstances of death and by the suffering of being born with remainder.

source: ངན་སོང་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་མ་གྲོལ་བ་དག་ཡིན་ནོ།
en: They are not free from the all the sufferings of the lower realms.

source: །སྡུག་བསྔལ་དེ་རྣམས་ཀྱིས་གཟིར་བ་དག་ཡིན་ཏེ། མཁས་པས་དེ་ལྟར་གཟུགས་མེད་པའི་ཁམས་དེ་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: Since they are tormented by such sufferings, the wise ones should generate the perception of dislike toward the formless realm.

source: །རྣམ་པ་བརྒྱད་པོ་དེ་དག་གིས་སྲིད་པ་གསུམ་གྱི་བཙོན་ར་ཐམས་ཅད་དུ་སྲིད་པ་མངོན་པར་གྲུབ་པ་ཡིན་ནོ།
en: “In those eight ways, existence manifests as all these prisons of the three realms.

source: །མཁས་པས་དེ་ལྟ་བུ་དང་ཡང་དག་པར་ལྡན་པའི་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་ཞིང་འདུན་པ་དྲག་པོས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བསྒོམ་པར་བྱ་སྟེ།
en: The wise ones should generate the perception of dislike in those ways and cultivate the eightfold path of the noble ones with fervent determination.

source: ཀཽ་ཌི་ནྱ་འདི་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སོ།
en: Kauṇḍinya, this was the perception of dislike toward the entire world.

source: །འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་གང་ཞེ་ན།
en: “What is the perception of dislike toward the world of formations?

source: འདུ་བྱེད་གསུམ་ཞེས་བྱ་སྟེ། འདི་ལྟ་སྟེ། ལུས་ཀྱི་འདུ་བྱེད་དང་། ངག་གི་འདུ་བྱེད་དང་། ཡིད་ཀྱི་འདུ་བྱེད་དོ།
en: This refers to the three types of formations—the physical, verbal, and mental formations.

source: །དེ་ལ་ལུས་ཀྱི་འདུ་བྱེད་གང་ཞེ་ན།
en: What are the physical formations?

source: དབུགས་རྔུབ་པ་དང་། དབུགས་འབྱུང་བ་རྣམས་ནི་ལུས་ཀྱི་འདུ་བྱེད་རྣམས་ཞེས་བྱའོ།
en: Inhalation and exhalation are referred to as the physical formations.

source: །དེ་ལ་ངག་གི་འདུ་བྱེད་གང་ཞེ་ན།
en: What are the verbal formations?

source: རྟོག་པ་དང་། དཔྱོད་པ་རྣམས་ནི་ངག་གི་འདུ་བྱེད་རྣམས་ཞེས་བྱའོ།
en: Concepts and analysis are referred to as the verbal formations.

source: །དེ་ལ་ཡིད་ཀྱི་འདུ་བྱེད་རྣམས་གང་ཞེ་ན།
en: What are the mental formations?

source: རྣམ་པར་ཤེས་པ་དང་སེམས་པའོ། །འདི་དག་ནི་ཡིད་ཀྱི་འདུ་བྱེད་རྣམས་ཞེས་བྱའོ།
en: Consciousness and thoughts are referred to as the mental formations.

source: །འདུ་བྱེད་གསུམ་པོ་འདི་དག་ནི་སེམས་ཅན་རྣམས་ཀྱི་མཚན་ཉིད་མཉམ་པ་རྣམས་སོ།
en: Those three types of formations are the characteristics shared by sentient beings.

source: །མཁས་པས་ཇི་ལྟར་འདུ་བྱེད་རྣམས་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་ཞེ་ན།
en: “How should the wise ones generate the perception of dislike toward formations?

source: མཁས་པས་གང་དབུགས་རྔུབ་པ་དང་། དབུགས་འབྱུང་བ་རྣམས་ཀྱི་མཚན་མ་ལ་གསར་པ་དང་རྙིང་པའི་ཚུལ་དང་། བསིལ་བའི་རྣམ་པ་དང་། དྲོ་བའི་རྣམ་པ་དང་མི་འཐུན་པའི་ཚུལ་གྱིས་ཉེ་བར་རྟོག་པར་བྱའོ།
en: They should examine the characteristics of their inhalation and exhalation in terms of freshness, staleness, coolness, warmth, and repulsiveness.

source: །ལུས་འབྱུང་བ་ཐམས་ཅད་ཀྱི་དབུགས་རྔུབ་པ་དང་། ལུས་ཐམས་ཅད་ཀྱི་དབུགས་འབྱུང་བ་དང་། རྨའི་སྒོ་རྣམས་ཀྱི་མཚན་མ་ལ་ཡང་ཉེ་བར་བརྟགས་ནས་འདུ་བྱེད་འདི་རྣམས་ནི་མ་བྱུང་བ་ལས་ཡང་དག་པར་བྱུང་བ་དག་གོ། །བྱུང་ནས་མེད་པར་གྱུར་པ་དག་གོ། །ཐམས་ཅད་གློག་ལྟ་བུ་དག་གོ་སྙམ་ཞིང་ཐམས་ཅད་དུ་ཟད་པར་འདུ་ཤེས་པར་ཡིད་ལ་བྱེད་ཅིང་དངོས་པོ་མེད་པར་འདུ་ཤེས་པར་ཡིད་ལ་བྱེད་དོ།
en: Having also examined the characteristics of the inhalation and exhalation of all bodies as well as their orifices, they will think, ‘These formations are like lightning—they arise out of nowhere and disappear right away.’ Thinking in that way, they will contemplate how formations are exhausted and insubstantial.

source: །གང་དུ་ཐ་དད་པར་རྟོག་པར་བྱེད་ན་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་འབྱུང་སྟེ། རྟོག་པ་རྣམས་ལ་ཟད་པའི་འདུ་ཤེས་དང་དངོས་པོ་མེད་པའི་འདུ་ཤེས་འབྱུང་ངོ་།
en: All concepts arise as one conceives of things as being different, and these perceptions of exhaustion and insubstantiality arise within concepts.

source: །ཆོས་དེ་ཉིད་ལ་གང་བསིལ་བའི་འདུ་ཤེས་དང་། དྲོ་བའི་འདུ་ཤེས་དང་། མི་འཐུན་པའི་འདུ་ཤེས་དང་། དེ་བཞིན་དུ་སར་པ་དང་རྙིང་པའི་འདུ་ཤེས་ཀྱང་རུང་འདུ་ཤེས་དང་སེམས་པ་དེ་དག་ལས་འབྱུང་སྟེ། ཐམས་ཅད་དུ་ཟད་པར་འདུ་ཤེས་པ་དང་དངོས་པོར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: All the perceptions of coolness, warmth, repulsiveness, freshness, and staleness related to those phenomena arise from such perceptions and thoughts, and they lead to the perception of total exhaustion and the perception of insubstantiality. They lead to the perception that all formations are exhausted and the perception that they disintegrate.

source: །དེ་འདུ་བྱེད་ཐམས་ཅད་ལ་ཟད་པར་འདུ་ཤེས་པ་དང་། འཇིག་པར་འདུ་ཤེས་པ་དང་། འདོད་ཆགས་དང་བྲལ་བར་འདུ་ཤེས་པ་དང་། འགོག་པ་ལ་དམིགས་པར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: They lead to the perception of the freedom from desire and the perception that apprehends cessation.

source: །དེ་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་མཐོང་བས་ཐམས་ཅད་དུ་ཟད་པར་འདུ་ཤེས་པ་ཞེས་བྱ་བ་ནས་འགོག་པ་ལ་དམིགས་པར་འདུ་ཤེས་པའི་བར་དུ་འགྱུར་རོ།
en: By seeing the past and future limits of all formations, they will develop the perception of total exhaustion up to the perception that focuses on cessation.

source: །སུས་དེ་ལྟར་འདུ་བྱེད་རྣམས་ལ་དམིགས་པ་ཤིན་ཏུ་ཡོངས་སུ་སྦྱང་བ་བྱས་པར་གྱུར་པ་དེ་འདུ་བྱེད་ཐམས་ཅད་ལ་མི་བརྟན་པར་འདུ་ཤེས་པ་དང་། རབ་ཏུ་འཇིག་པར་འདུ་ཤེས་པ་དང་། ཡིད་མི་བརྟན་པར་འདུ་ཤེས་པ་དང་། མི་རྟག་པར་འདུ་ཤེས་པ་དང་། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་དང་། བདག་མེད་པར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: Those who have thoroughly purified their way of apprehending formations will perceive all formations as being transitory, perishable, unreliable, impermanent, insubstantial, and selfless.

source: །དེ་ལྟ་བུར་ཡང་དག་པར་བརྩོན་པའི་སེམས་དང་ལྡན་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཤེས་ནས་འདུ་བྱེད་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: Diligent beings who thus correctly understand will develop the perception of dislike toward all formations.

source: །དེ་བཞིན་དུ་ཡང་སོ་སོར་བརྟགས་པའི་འགོག་པ་ལ་དམིགས་པའམ་སོ་སོར་བརྟགས་པ་མ་ཡིན་པའི་འགོག་པ་ལ་དམིགས་པས་དུས་གསུམ་ལ་རྗེས་སུ་སེམས་པར་བྱེད། ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་སྤོང་བར་བྱེད། མཐོང་བ་རྣམ་པར་དག་པར་བྱེད།
en: Similarly, by focusing on analytical and nonanalytical cessation, they will apprehend the three times, abandon all fetters, completely purify their vision, and sever the continuity of saṃsāra.

source: འཁོར་བའི་རྒྱུན་སྤོང་བར་བྱེད་ཅིང་ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པར་ཞུགས་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་བྱེད་དོ།
en: Having entered into the faultless reality, they will attain the fruition of the stream enterers.

source: །ཀཽ་ཌི་ནྱ་མཁས་པ་ནི་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དོ།
en: Kauṇḍinya, this is how the wise ones generate the perception of dislike toward the world of formations in all its aspects.

source: །ཀཽ་ཌི་ནྱ་འདི་ནི་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་ཀྱི་སྦྱོར་བའི་དམིགས་པའོ།
en: Kauṇḍinya, this is the contemplation that brings about the perception of dislike.

source: །དེ་ལ་ཆོས་གོས་ལ་མི་འཐུན་པའི་འདུ་ཤེས་གང་ཞེ་ན།
en: “What is the perception of repulsiveness toward Dharma robes?

source: ཀཽ་ཌི་ནྱ་མཁས་པས་གང་གི་ཚེ་ཆོས་གོས་མཐོང་ངམ། རེག་གམ། ཤམ་ཐབས་སུ་བྱེད་དམ། གྱོན་པར་བྱེད་དམ། བཞག་གམ། སྦས་ཀྱང་རུང་སྟེ་དེ་ཐམས་ཅད་དུ་འདི་ནི་མིའི་པགས་པའོ། །དེ་ལ་ཁྲག་གིས་བསྐུས་པའོ། །ཁྲག་འཛག་པའོ། །མཆོག་ཏུ་དྲི་མི་ཞིམ་པའོ།
en: Kauṇḍinya, whenever the wise ones see Dharma robes, touch them, use them as garments, wear them, take them off, or conceal them, they should develop feelings of revulsion by regarding them as human skin smeared with blood that is bleeding, stinking, and covered with maggots and flies.

source: །ཐམས་ཅད་ཀྱིས་སྐྱོན་བགྲང་བར་བྱའོ། །སྲིན་བུ་དང་སྦྲང་བུས་གང་བའོ། །མཛངས་པ་རྣམས་ཀྱིས་མངོན་པར་དགའ་བར་བྱ་བ་མ་ཡིན་པའོ་ཞེས་དེ་ལྟ་བུར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: In that way, clever beings will develop the perception that these robes should not be enjoyed.

source: །མཁས་པ་དེ་ལྟར་ཆོས་གོས་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སྐྱེད་དོ། །ཀཽ་ཌི་ནྱ་མཁས་པས་ཇི་ལྟར་ཟས་ལ་མི་འཐུན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་ཞེ་ན།
en: This is how the wise ones generate the perception of dislike toward Dharma robes. “Kauṇḍinya, how should the wise ones generate the perception of disgust toward food?

source: མཁས་པས་གང་ཟས་བླངས་པར་གྱུར་ན་དེ་ཟས་འདི་ཡང་ནང་གྲོལ་ལོ། །སྐྲ་དང་པགས་པ་མེད་ཅིང་རྣག་དང་ཁྲག་གིས་བསྐུས་པ་སྲིན་བུ་དང་། སྦྲང་བུས་ཡོངས་སུ་བསྐོར་བའོ། །སྣོད་འདི་ནི་མི་མགོའི་ཐོད་པ་མཆོག་ཏུ་དྲི་ང་བ་སྐྱོན་དུ་བགྲང་བར་བྱའོ་ཞེས་དེ་ལྟ་བུར་འདུ་ཤེས་སྐྱེད་དེ། གལ་ཏེ་འབྲས་ཅན་ཞིག་ལེན་ན་མི་རོ་སྲིན་བུས་གང་བའོ། །ཞེས་དེ་ལྟ་བུར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: When the wise ones eat food, they should develop feelings of revulsion by thinking, ‘This food is made of entrails, it is hairless and skinless flesh smeared with pus and blood and infested by maggots and flies, and this bowl is a stinking human skull!’ If they eat rice gruel, they should perceive it as a human corpse covered by maggots.

source: །གལ་ཏེ་ཆུ་ཞིག་ལེན་ན་དེ་འདི་ནི་མིའི་ཁྲག་མཆོག་ཏུ་སྐྱོན་དུ་བགྲང་བར་བྱའོ་ཞེས་བྱ་བ་དང་།
en: If they drink water, they should develop feelings of intense revulsion by regarding it as human blood.

source: དེ་བཞིན་དུ་ཕྱེ་དག་ལ་འདི་ནི་མིའི་རུས་པའི་ཕྱེ་མའོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་དུ་ཁུར་སྐྱལ་འདི་ནི་མིའི་པགས་པའོ་ཞེས་དེ་ལྟར་འདུ་ཤེས་པར་འགྱུར་རོ།
en: Similarly, they should perceive flour as the dust of crushed human bones, and milk cream as human skin.

source: །དེ་བཞིན་དུ་ཤ་ཁུ་དང་། ཐུག་པ་དང་། ཚོད་མ་དང་། སྲན་ཚོད་ཀྱང་རུང་སྟེ། དེ་ལ་འདི་ནི་མིའི་ཁྲག་གོ། །འདི་ནི་མིའི་ཀླད་པའོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་དུ་སྔ་སྔོ་ལ་འདི་ནི་མིའི་སྐྲའོ། །འདི་ནི་མིའི་སོའོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་དུ་ཤ་ལ་འདི་ནི་མིའི་ཤའོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་དུ་ལི་ཁར་དང་། བུ་རམ་དང་། རྒུན་ཆང་དང་། བལ་པོ་སེའུའི་ཁུ་བ་ལ་འདི་ནི་མིའི་ཁྲག་གོ། །མིའི་ཀླད་པའོ། །མིའི་བད་ཀན་ནོ། །མིའི་རུས་པའི་རྐང་ངོ་ཞེས་བྱ་བ་དེ་ལྟ་བུར་འདུ་ཤེས་སྐྱེད་དེ།
en: They should also perceive all meat broths, soups, vegetable stews, and lentils as human blood and brain, vegetables as human hairs and teeth, meat as human flesh, and the juices of sugar canes, molasses, grapes, and pomegranates as human blood, brain, phlegm, and marrow.

source: ཀཽ་ཌི་ནྱ་མཁས་པས་དེ་ལྟར་ཟས་ལ་མི་འཐུན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: Kauṇḍinya, this is how the wise ones should generate the perception of disgust toward food.

source: །ཀཽ་ཌི་ནྱ་མཁས་པས་ཇི་ལྟར་ཁྱིམ་མམ། གནས་ཁང་ངམ། ཁང་པ་བརྩེགས་མར་འཇུག་པའི་ཚེ་འཇིགས་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ་ཞེ་ན།
en: “Kauṇḍinya, how should the wise ones generate the feeling of fear when they enter households, houses, or storied mansions?

source: གྲོང་ཁྱེར་ཆེན་པོ་སྒོ་བཞི་པ་འདིར་ཞུགས་པས་བདག་སྲེག་གོ། །འཇུག་པ་ན་ཤིང་ལ་མེར་འདུ་ཤེས་པ་དང་། འཇིམ་པ་ལ་མིའི་ཤར་འདུ་ཤེས་པ་དང་། རི་མོ་ལ་མིའི་ཁྲག་ཏུ་འདུ་ཤེས་པ་དང་། མལ་ཆ་ལ་མིའི་པགས་པ་ཉིད་དུ་འདུ་ཤེས་པ་དང་། སྟན་ལ་མིའི་རུས་གོང་གི་ཕུང་པོ་འམ། མི་རོར་བྱིན་གྱིས་རློབ་པར་བྱེད་པ་དེ་ལྟ་བུར་འདུ་ཤེས་པ་འཇུག་པར་བྱའོ། །རྩིའི་རྣམ་པ་དེ་ལྟ་བུ་ལ་སོ་སོར་སྟེན་པར་བྱེད་པ་ན་ཡང་ཆོས་དེ་དག་ཡིད་ལ་བྱའོ།
en: They should develop that feeling by imagining that they are burned like a tree consumed by fire as they enter one of the four gates of a great city and by perceiving the plaster on the houses as human flesh, the paintings as drawings made with human blood, the beddings as human skin, and the seats as heaps of human bones or human corpses.’ They should contemplate those images and apply such remedies.

source: །ཀཽ་ཌི་ནྱ་མཁས་པ་དེ་ལྟ་བུར་འདུ་ཤེས་པ་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་ཐོབ་པར་འགྱུར་རོ།
en: Kauṇḍinya, the wise ones who perceive in that way will develop a perception of dislike toward the entire world.

source: །སུ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བར་འདུ་ཤེས་པར་འགྱུར་བ་དེ་ཡོན་ཏན་དང་ཕན་ཡོན་ཅི་ཐོབ་ཅེ་ན།
en: “What qualities and benefits do those who develop the perception of dislike toward the entire world gain?

source: དེ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་གསུམ་ཐོབ་པར་འགྱུར་རོ།
en: They will achieve the three concordant acceptances.

source: སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་། སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་། མཚན་མ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པའོ།
en: They are (1) the acceptance that accords with the absence of wishes, (2) the acceptance that accords with emptiness, and (3) the acceptance that accords with the absence of marks.

source: །འཇིག་རྟེན་གྱི་བཟོད་པ་གསུམ་པོ་དེ་དག་ཐོབ་པས་ཕན་ཡོན་ཐོབ་པར་བྱེད་དེ།
en: They will be benefitted by achieving those three worldly acceptances;

source: དེའི་སེམས་སྟོང་པ་ཉིད་ཀྱི་ལྟ་བ་ལ་འཇུག་པར་བྱེད་དོ། །དེ་སྐྱེ་བ་དང་འཇིག་པའི་ཚུལ་གྱིས་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལ་ཡིད་འཇུག་པར་བྱེད་དོ།
en: their minds will penetrate the meaning of the view of emptiness as well as the nonexistence of formations that arise and disintegrate.

source: །དེ་ཕུང་པོའི་རང་བཞིན་ལ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་ཉིད་དང་བདག་མེད་པའི་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They will see that the aggregates are intrinsically impermanent, painful, empty, and selfless.

source: ཁམས་རྣམས་ཞེས་བྱ་བ་ནས་སྐྱེ་མཆེད་རྣམས་ཞེས་བྱ་བའི་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །བདེན་པ་རྣམས་ཞེས་བྱ་བའི་བར་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཞེས་བྱ་བའི་བར་ལ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་མི་རྟག་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །སྡུག་བསྔལ་ཉིད་དང་བདག་མེད་པ་ཉིད་ཀྱི་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: They will see that all phenomena—from the elements to the sense sources, the truths, and dependent origination—are intrinsically impermanent, painful, empty, and selfless.

source: །དེ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་བོ་ཞེས་བྱ་བ་ནས་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་འཐོབ་སྟེ།
en: They will attain the fruition of the stream enterers and the other fruitions up to the level of the worthy ones.

source: ཀཽ་ཌི་ནྱ་འདི་ནི་མི་སློབ་པའི་རྣམ་པར་གྲོལ་བ་མཉམ་པར་གཞག་པའོ།
en: Kauṇḍinya, this is the equipoise of the liberation of no more training.

source: །ཀཽ་ཌི་ནྱ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་འདི་ནི་སེམས་ཅན་རྣམས་ཀྱི་གཅེས་སྤྲས་བྱེད་པའོ།
en: “Kauṇḍinya, this perception of dislike toward the entire world is very helpful for sentient beings.

source: །འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡང་དག་པར་སྤོང་བར་བྱེད་པའོ། །གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡང་དག་པར་སྤོང་བར་བྱེད་པའོ། །ང་རྒྱལ་དང་། རྒོད་པ་དང་། ཐེ་ཙོམ་དང་། མ་རིག་པའི་མུན་པ་ཐམས་ཅད་སྤོང་བར་བྱེད་པའོ།
en: It causes them to abandon all forms of attachment associated with the desire realm, the form realm, and the formless realm, as well as pride, agitation, doubt, and the entire darkness of ignorance.

source: །ལྷག་མ་མེད་པའི་སའི་བར་ལ་འཇོག་པར་བྱེད་པའོ།
en: It establishes them up to the level that is without remainder.

source: །དོན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་བརྩེགས་རྒྱལ་པོས་གང་ང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བ་དཔལ་གྱི་སྙིང་པོའི་ལག་ནས་བསྐུར་ཞིང་། འདུས་པ་ཆེན་པོ་འདི་ལ་ངས་བཤད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་པ་འདི་ནི་མཐུ་ཆེ་བ་ཕན་ཡོན་ཆེ་བའོ།
en: This dhāraṇī mantra that fulfills all goals and accords with the absence of wishes that the thus-gone Royal Mass of Glorious Wisdom conferred upon me through the bodhisattva great being Glorious Essence of Light is very powerful and beneficial—it is a dhāraṇī mantra that bestows faith in the teachings I expound to this great assembly.

source: །འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་དང་གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཡང་དག་པར་ཟད་པར་བྱེད་པའོ། །ང་རྒྱལ་ཐམས་ཅད་ཡང་དག་པར་ཟད་པར་བྱེད་པའོ།
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realm, as well as pride.

source: །ཟད་པ་ཤེས་པ་དང་མི་སྐྱེ་བ་ཤེས་པའི་བར་དུ་བྱེད་པའོ། །མི་སྐྱེ་བའི་ཡེ་ཤེས་མཐོང་བར་བྱེད་པའོ། །མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བྱེད་པའོ། །རྣམ་པར་འཇིག་པར་བྱེད་པའོ། །སྡུག་བསྔལ་གྱི་ཁུར་ཐམས་ཅད་འདོར་བར་བྱེད་པའོ།
en: It generates the knowledge of exhaustion and the knowledge of the unborn, induces the wisdom vision of the unborn, overcomes and completely destroys all the dense darkness of ignorance, and removes the entire burden of suffering.

source: །བདུད་རྣམས་ཚར་གཅོད་པར་བྱེད་པའོ། །ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཕམ་པར་བྱེད་པའོ། །ལྷ་རྣམས་ཐམས་ཅད་དགའ་བར་བྱེད་པའོ། །གནོད་སྦྱིན་ཐམས་ཅད་མགུ་བར་བྱེད་པའོ། །ལྷ་མ་ཡིན་རྣམས་རྣམ་པར་འཇོམས་པར་བྱེད་པའོ། །ནམ་མཁའ་ལྡིང་རྣམས་དངང་བར་བྱེད་པའོ། །མི་འམ་ཅི་རྣམས་དད་པར་བྱེད་པའོ། །ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དངང་བར་བྱེད་པའོ། །
en: It annihilates the māras, defeats the enemies, pleases all the gods, delights all the yakṣas, overcomes the asuras, terrifies the garuḍas, generates faith in the kinnaras, and scares away the mahoragas.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་ངེས་པར་ཐུལ་བར་བྱེད་པའོ། །རྒྱལ་རིགས་རྣམས་མངོན་པར་དད་པར་བྱེད་པའོ། །བྲམ་ཟེ་རྣམས་འཇུག་པར་བྱེད་པའོ། །རྗེའུ་རིགས་རྣམས་དགའ་བར་བྱེད་པའོ། །དམངས་རིགས་རྣམས་མཆོག་ཏུ་དགའ་བར་བྱེད་པའོ། །
en: It subdues the enemies, generates faith in the members of the kṣatriya class, induces comprehension in the brāhmaṇas, delights the vaiśyas, and utterly pleases the śūdras.

source: བུད་མེད་རྣམས་འདོད་ཆགས་དང་བྲལ་བར་བྱེད་པའོ། །མང་དུ་ཐོས་པ་རྣམས་སྐྱོ་བར་བྱེད་པའོ། །རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་མངོན་པར་དགའ་བར་བྱེད་པའོ།
en: It frees women from their desires, induces weariness in the scholars, and delights the spiritual practitioners.

source: །འཇིག་རྟེན་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའོ། །འཐབ་པ་དང་། ཐབ་མོ་དང་། མུ་གེ་དང་། ནད་དང་། དུས་མ་ཡིན་པའི་ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། ཆུ་བོ་དང་། གྲང་བ་དང་། དྲོ་བ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། རྩུབ་པ་དང་། རོ་མི་བྲོ་བ་དང་། རེག་པར་དཀའ་བའི་དངོས་པོ་ཐམས་ཅད་རྣམ་པར་ཞི་བར་བྱེད་པའོ།
en: It completely pacifies the entire world as well as all quarrels, fights, famines, diseases, unexpected hostile armies, untimely winds, rains, floods, cold, heat, snow, and heat waves, and it softens all the substances that are harsh, tasteless, and difficult to touch.

source: །ཆོས་ཀྱི་ཚུལ་འབར་བར་བྱེད་པའོ། །དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱེད་པའོ། །སངས་རྒྱས་ཀྱི་བསྟན་པ་སྟོན་པར་བྱེད་པའོ། །འཁོར་བས་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བྱེད་པ་སྟེ།
en: It causes the way of the Dharma to blaze, ensures that the lineage of the Three Jewels remains uninterrupted, reveals the teachings of the buddhas, and provides relief to those who are afraid of saṃsāra.

source: འདི་ནི་སྨོན་པ་མེད་པ་དང་། རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཡིན་ནོ།
en: This is the dhāraṇī mantra that accords with the absence of wishes.”

source: །བསྟན་པ་འདི་བཤད་པ་ན་སེམས་ཅན་ལྷ་དང་མི་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་ཐོབ་པར་གྱུར་ཏོ། །དཀྲིགས་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: As this teaching was being given, an innumerable and limitless number of gods and humans attained the eye of Dharma that is immaculate and spotless with regard to phenomena, and the minds of nine billion eight hundred million beings were liberated from defilements with no further grasping.

source: །དེའི་ཚེ་ཁྲི་ཕྲག་བརྒྱད་ནི་སྨོན་པ་མེད་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་འདི་ཐོབ་པར་གྱུར་ཏོ། །དེའི་ཚེ་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །དེའི་ཚེ་འབུམ་ཕྲག་ལྔ་བཅུ་རྩ་བརྒྱད་ནི་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: At that time, eighty thousand beings attained this dhāraṇī mantra that accords with the absence of wishes, an innumerable and limitless number of them gave rise to the mind set on unsurpassed and perfect awakening and reached the level of nonregression, and five million eight hundred thousand reached acceptance of the unborn nature of phenomena.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། མི་དང་། མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: All the gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, kumbhāṇḍas, humans, and nonhumans exclaimed, “Excellent!
